ProgessBase/Documents/ДС_КорректировкаРасходовПоРеализацииПродукцииСНеПрошедшимПравомСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ДС_КорректировкаРасходовПоРеализацииПродукцииСНеПрошедшимПравомСобственности</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Международный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРеверсирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СодержаниеОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/AccountingRegisters/Международный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Международный</Name>
			<Comment>(Упр)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Международный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПервичныйНомерСтроки</Name>
					<Comment>Необходим для переноса затрат</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПравилоПереносаДт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаСоответствияСчетовБУиМСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_НомерСтрокиПравилаПереносаДт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПравилоПереносаКт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаСоответствияСчетовБУиМСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_НомерСтрокиПравилаПереносаКт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

ProgessBase/Documents/ДС_КорректировкаРасходовПоРеализацииПродукцииСНеПрошедшимПравомСобственности/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Международный.Записывать	= Истина;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДС_КорректировкаРасходовПоРеализацииПродукцииСНеПрошедшимПравомСобственностиКорректировка.Документ,
		|	ДС_КорректировкаРасходовПоРеализацииПродукцииСНеПрошедшимПравомСобственностиКорректировка.СодержаниеОперации
		|ПОМЕСТИТЬ ВТСодержание
		|ИЗ
		|	Документ.ДС_КорректировкаРасходовПоРеализацииПродукцииСНеПрошедшимПравомСобственности.Корректировка КАК ДС_КорректировкаРасходовПоРеализацииПродукцииСНеПрошедшимПравомСобственностиКорректировка
		|ГДЕ
		|	ДС_КорректировкаРасходовПоРеализацииПродукцииСНеПрошедшимПравомСобственностиКорректировка.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДС_КорректировкаРасходовПоРеализацииПродукцииСНеПрошедшимПравомСобственностиКорректировка.СодержаниеОперации,
		|	ДС_КорректировкаРасходовПоРеализацииПродукцииСНеПрошедшимПравомСобственностиКорректировка.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МеждународныйДвиженияССубконто.СчетДт,
		|	МеждународныйДвиженияССубконто.СубконтоДт1,
		|	МеждународныйДвиженияССубконто.СубконтоДт2,
		|	МеждународныйДвиженияССубконто.СубконтоДт3,
		|	МеждународныйДвиженияССубконто.СчетКт,
		|	МеждународныйДвиженияССубконто.СубконтоКт1,
		|	МеждународныйДвиженияССубконто.СубконтоКт2,
		|	МеждународныйДвиженияССубконто.СубконтоКт3,
		|	МеждународныйДвиженияССубконто.Организация,
		|	МеждународныйДвиженияССубконто.ВалютаДт,
		|	МеждународныйДвиженияССубконто.ВалютаКт,
		|	МеждународныйДвиженияССубконто.Сумма,
		|	МеждународныйДвиженияССубконто.ВалютнаяСуммаДт,
		|	МеждународныйДвиженияССубконто.ВалютнаяСуммаКт,
		|	МеждународныйДвиженияССубконто.КоличествоДт,
		|	МеждународныйДвиженияССубконто.КоличествоКт,
		|	ВТСодержание.СодержаниеОперации КАК Содержание
		|ИЗ
		|	РегистрБухгалтерии.Международный.ДвиженияССубконто(, , ПервичныйДокумент В (&Регистратор), , ) КАК МеждународныйДвиженияССубконто
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСодержание КАК ВТСодержание
		|		ПО МеждународныйДвиженияССубконто.ПервичныйДокумент = ВТСодержание.Документ";

	Запрос.УстановитьПараметр("Регистратор", Корректировка.ВыгрузитьКолонку("Документ"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		СформироватьПроводки(Выборка, Истина); 
		СформироватьПроводки(Выборка, Ложь); 

	КонецЦикла;   
	
КонецПроцедуры

Процедура СформироватьПроводки(Выборка, Сторно)
		
	Движение		= Движения.Международный.Добавить();
	Движение.Период = ?(Сторно = Истина, Дата, ДатаРеверсирования);
	ЗаполнитьЗначенияСвойств(Движение, Выборка);
	
	Если Сторно Тогда
		Движение.Сумма = -Выборка.Сумма;
	КонецЕсли;
	
	БухгалтерскийУчет.УстановитьСубконто(Выборка.СчетКт, Движение.СубконтоКт, 1, Выборка.СубконтоКт1);
	БухгалтерскийУчет.УстановитьСубконто(Выборка.СчетКт, Движение.СубконтоКт, 2, Выборка.СубконтоКт2);
	БухгалтерскийУчет.УстановитьСубконто(Выборка.СчетКт, Движение.СубконтоКт, 3, Выборка.СубконтоКт3);
	БухгалтерскийУчет.УстановитьСубконто(Выборка.СчетДт, Движение.СубконтоДт, 1, Выборка.СубконтоДт1);
	БухгалтерскийУчет.УстановитьСубконто(Выборка.СчетДт, Движение.СубконтоДт, 2, Выборка.СубконтоДт2);
	БухгалтерскийУчет.УстановитьСубконто(Выборка.СчетДт, Движение.СубконтоДт, 3, Выборка.СубконтоДт3);
	
КонецПроцедуры	

Процедура ПриЗаписи(Отказ)
	
	
	//Проверяем на дублируемость документов в табличной части
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДС_КорректировкаРасходовПоРеализацииПродукцииСНеПрошедшимПравомСобственностиКорректировка.Документ КАК Документ
		|ИЗ
		|	Документ.ДС_КорректировкаРасходовПоРеализацииПродукцииСНеПрошедшимПравомСобственности.Корректировка КАК ДС_КорректировкаРасходовПоРеализацииПродукцииСНеПрошедшимПравомСобственностиКорректировка
		|ГДЕ
		|	ДС_КорректировкаРасходовПоРеализацииПродукцииСНеПрошедшимПравомСобственностиКорректировка.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДС_КорректировкаРасходовПоРеализацииПродукцииСНеПрошедшимПравомСобственностиКорректировка.Документ
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ДС_КорректировкаРасходовПоРеализацииПродукцииСНеПрошедшимПравомСобственностиКорректировка.Документ) > 1";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда 
		Сообщить("В табличной части дублируются документы !");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
